'''
Рекурсія добре підходить до задачі flatentening. Це процес вирівнювання списків, який полягає в позбавленні вкладеної
структури. Наприклад список вигляду [1, 2, [3, 4, [5, 6]], 7] має бути перетворений на плоский (flat) список
[1, 2, 3, 4, 5, 6, 7]

Функція flatten приймає на вхід список, рекурсивно вирівнюває цей список і повертає пласку версію списку.

Для виконання функція дотримується наступного алгоритму:

Якщо вхідний список порожній, то:
  Повертаємо порожній список
Якщо перший елемент списку є списком, то:
  Отримуємо перший список, рекурсивно викликавши функцію з першим елементом списку
  Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
  Повертаємо конкатенацію двох списків
Якщо перший елемент списку не є списком, то:
  Отримуємо перший список із першого елемента списку
  Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
  Повертаємо конкатенацію двох списків
'''


def flatten(data):
    if len(data) == 0:
        return []
    elif isinstance(data[0], list):
        list1 = flatten(data[0])
        list2 = flatten(data[1:])
        return list1 + list2
    else:
        list1 = [data[0]]
        list2 = flatten(data[1:])
        return list1 + list2


print(flatten([1, 2, [3, 4, [5, 6]], 7]))
