'''
 Розбиття рядка на лексеми є процес перетворення вихідного рядка в список з підрядків, званих лексемами (token).

В арифметичному виразі лексемами є: оператори, числа та дужки. Операторами у нас будуть такі символи: *, /, - та +.
Оператори та дужки легко виділити у рядку — вони складаються з одного символу і ніколи не є частиною інших лексем.
Числа виділити складніше, оскільки ці лексеми можуть складатися з кількох символів. Тому будь-яка безперервна
послідовність цифр — це одна числова лексема.

Напишіть функцію, яка приймає параметр рядок, що містить математичний вираз, і перетворює його в список лексем.
Кожна лексема має бути або оператором, або числом, або дужкою.
Приклад:

"2+ 34-5 * 3" => ['2', '+', '34', '-', '5', '*', '3']
'''


def token_parser(s):
    separators = [' ', '+', '-', '*', '/', '(', ')']
    result = []
    lexeme = ''
    for char in s:
        if char in separators:
            if lexeme:
                result.append(lexeme)
                lexeme = ''
            if char != ' ':
                result.append(char)
        else:
            lexeme += char
    if lexeme:
        result.append(lexeme)

    return result
